#任务  判断如果你输入的数字大于随机生成的数字那么给一个提示你猜大了
#                      小于                         小了
#起始资充钱 1000  （账户原有资金+刚充值的资金）10%  2000 20%   每猜一次-500一直执行
#游戏开始按1   退出游戏Q
#资金小于500 锁死系统
#5次猜对，5次机会用光了就退出
import  random#随机产生一个数字
ran=random.randint(0,90)#范围(0~90)
print("=======================================")
print("**************猜·字·游·戏***************")
print("=======================================")
print("************游·戏·开·始·按·1************")
print("=======================================")
print("************退·出·游·戏·按·q************")
print("=======================================")
start = input("是否开始游戏")
if start == "1":
    print(ran)
    coin = 0
    sum = 0
    coin = int(input("余额不足，请输入充值金额"))
    if coin < 2000:
        sum = coin + (coin * 0.1)
        print("充值成功", "当前余额为", sum)
    else:
        coin > 2000
        sum = coin + (coin * 0.2)
        print("充值成功", "当前余额为", sum)
    i = 0
    print("充值成功", "当前余额为", sum, "当前可输入次数为", 5 - i)
    # 当金币大于500时，才进入循环
    while coin >= 500 and i < 5:
        num = int(input("请输入数字："))
        if num > ran:
            i = i + 1
            sum = sum - 500
            print("稍微大了一点点哦！", "当前余额为", sum, "当前可输入次数为", 5 - i)
        elif num < ran:
            i = i + 1
            sum = sum - 500
            print("稍微小了一点点哦！", "当前余额为", sum, "当前可输入次数为", 5 - i)
        else:
            sum = sum + 5000
            print("恭喜你呦！", "当前余额为", sum)
            break
elif start == "q":
    pass


